---
kind: other
id: Methods.T:Autodesk.Revit.DB.SharedParameterApplicableRule
source: html/cab1a64d-8421-f510-b63d-63922612a5f2.htm
---
# SharedParameterApplicableRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.